; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 11443)
	(= (fuel plane1) 3800)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 17)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at person1 city4)
	(at person2 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 865)
	(= (distance city0 city2) 524)
	(= (distance city0 city3) 879)
	(= (distance city0 city4) 627)
	(= (distance city1 city0) 865)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 770)
	(= (distance city1 city3) 776)
	(= (distance city1 city4) 550)
	(= (distance city2 city0) 524)
	(= (distance city2 city1) 770)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 579)
	(= (distance city2 city4) 828)
	(= (distance city3 city0) 879)
	(= (distance city3 city1) 776)
	(= (distance city3 city2) 579)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 539)
	(= (distance city4 city0) 627)
	(= (distance city4 city1) 550)
	(= (distance city4 city2) 828)
	(= (distance city4 city3) 539)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city4)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2695, (fuel plane1) from 3800 to 1105
   goals met: 1 of 2
2. (board person2 plane1 city3)
   deleted: (at person2 city3)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 2
3. (refuel plane1 city3)
   changed: (fuel plane1) from 1105 to 11443
   goals met: 1 of 2
4. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2695 to 5390, (fuel plane1) from 11443 to 8748
   goals met: 1 of 2
5. (debark person2 plane1 city4)
   deleted: (in person2 plane1)
   added: (at person2 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 2
